package org.example.lessons.lesson07.homeworks

fun main () {
//Прямой диапазон
//Напишите цикл for, который выводит числа от 1 до 5.
    for (a in 1..5)
        println(a)

//Напишите цикл for, который выводит четные числа от 1 до 10.
    for (b in 1..10)
        if (b % 2 == 0)
            println(b)

//Обратный диапазон
//Создайте цикл for, который выводит числа от 5 до 1.
    for (c in 5 downTo 1)
        println(c)

//Создайте цикл for, который выводит числа от 10 до 1, уменьшая их на 2.
    for (d in 10 downTo 1)
        if (d % 2 == 0)
            println(d)

//С шагом (step)
//Используйте цикл for с шагом 2 для вывода чисел от 1 до 9.
    for (e in 1..9 step 2)
        println(e)

//Напишите цикл for, который выводит каждое третье число в диапазоне от 1 до 20.
    for (f in 1..20 step 3)
        println(f)

//Использование до (until)
//Создайте числовую переменную 'size'.
// Используйте цикл for с шагом 2 для вывода чисел от 3 до size не включая size.
    val size = 30
    for (g in 3 until size step 2)
        println(g)

//Задания для цикла while
//Цикл while
//Создайте цикл while, который выводит квадраты чисел от 1 до 5.
    var h = 1
    while (h <= 5) {
        println(h * h)
        h++
    }

//Напишите цикл while, который уменьшает число от 10 до 5.
// После этого вывести результат в консоль
    var j = 10
    while (j >= 5) {
        println(j)
        j--
    }
//Цикл do while
//Используйте цикл do while, чтобы вывести числа от 5 до 1.
    var i = 5
    do {
        println(i)
        i--
    } while (i >= 1)
//Создайте цикл do while, который повторяется, пока счетчик меньше 10, начиная с 5.
    var k = 5
    do {
        println(k)
        k++
    } while (k < 10)

//Задания для прерывания и пропуска итерации
//Использование break
//Напишите цикл for от 1 до 10 и используйте break, чтобы выйти из цикла при достижении 6.
    for (l in 1..10) {
        if (l == 6) break
        println(l)
    }
//Создайте цикл while, который бесконечно выводит числа, начиная с 1, но прерывается при достижении 10.
    var m = 1
    while (true) {
        if (m > 10) {
            break
        }
        println(m)
        m++
    }

//Использование continue
//В цикле for от 1 до 10 используйте continue, чтобы пропустить четные числа.
    for (n in 1..10) {
        if (n % 2 == 0) continue
        println(n)
    }
//Напишите цикл while, который выводит числа от 1 до 10, но пропускает числа, кратные 3.
    var o = 1
    while (o <= 10) {
        if (o % 3 == 0) {
            o++
            continue
        }
        println(o)
        o++
    }
}