package org.example.lessons.org.example.lessons.lesson12.homeworks

import kotlin.collections.associate

fun main() {
    val collections = listOf(-2, 24, 69, 1, -4, 0, 121)
    val textCollections = listOf("Kotlin", "Коллекции")
    val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
    val result = fun2(grades)
    println(result)
    val list3 = listOf("Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка", "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик", "сувенир", "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка")
    val result2 = fun4(list3)
    println(result2)
    val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
    val result3 = fun5(numbers)
    println(result3)
    val ages = listOf(22, 18, 30, 45, 17, null, 60)
    val checkAge = 18
    val result4 = fun6(ages, checkAge)
    println(checkAge)
    println(result)
//Задачи на приведение коллекции к значению
//Проверить, что размер коллекции больше 5 элементов.
    println(collections.size > 5)

//Проверить, что коллекция пустая
    println(collections.isEmpty())

//Проверить, что коллекция не пустая
    println(collections.isNotEmpty())

//Взять элемент по индексу или создать значение если индекса не существует
    println(collections.getOrElse(2) { 0 })

//Собрать коллекцию в строку
    println(collections.joinToString())

//Посчитать сумму всех значений
    println(collections.sum())

//Посчитать среднее
    println(collections.average())

//Взять максимальное число
    println(collections.maxOrNull())

//Взять минимальное число
    println(collections.minOrNull())

//Взять первое число или null
    println(collections.firstOrNull())

//Проверить что коллекция содержит элемент
    println(collections.contains(69))

//Задачи на обработку коллекций
//Отфильтровать коллекцию по диапазону 18-30
    println(collections.filter { it in 18..30 })

//Выбрать числа, которые не делятся на 2 и 3 одновременно
    println(collections.filterNot { (it % 2 == 0 && it % 3 == 0) })

//Очистить текстовую коллекцию от null элементов
    println(textCollections.filterNotNull())

//Преобразовать текстовую коллекцию в коллекцию длин слов
    println(textCollections.map { it.length })

//Преобразовать текстовую коллекцию в мапу, где ключи - перевёрнутые слова, а значения - длина слов
    println(textCollections.associate { it.reversed() to it.length })

//Отсортировать список в алфавитном порядке
    println(textCollections.sorted())

//Взять первые 3 элемента списка
    println(collections.take(3))

//Распечатать квадраты элементов списка
    collections.forEach { println(it * it) }

//Группировать список по первой букве слов
    println(textCollections.groupBy { it[0] })

//Очистить список от дублей
    println(collections.distinct())

//Отсортировать список по убыванию
    println(collections.sortedDescending())

//Взять последние 3 элемента списка
    println(collections.takeLast(3))
}

//Реши задачи ниже в отдельных функциях.
//Задача 24. Характеристика числовой коллекции
//Напиши функцию, которая принимает коллекцию чисел и возвращает строку с характеристикой коллекции используя конструкцию when
//Если коллекция пустая - “Пусто”
//Если количество элементов меньше пяти - “Короткая”
//Если коллекция начинается с 0 - “Стартовая”
//Если сумма всех чисел больше 10000 - “Массивная”
//Если среднее значение равно 10 - “Сбалансированная”
//Если длина строки образованная склеиванием коллекции в строку равна 20 - “Клейкая”
//Если максимальное число меньше -10 - “Отрицательная”
//Если минимальное число больше 1000 - “Положительная”
//Если содержит одновременно числа 3 и 14 - “Пи***тая”
//Иначе - “Уникальная”
//Вызвать метод с данными, подходящими под каждую из веток
fun fun1(list1: List<Int>): String {
    return when {
        list1.isEmpty() -> "Пусто"
        list1.size < 5 -> "Короткая"
        list1.first() == 0 -> "Стартовая"
        list1.sum() > 10000 -> "Массивная"
        list1.average().toInt() == 10 -> "Сбалансированная"
        list1.joinToString("").length == 20 -> "Клейкая"
        (list1.maxOrNull() ?: 0) < -10 -> "Отрицательная"
        (list1.minOrNull() ?: 0) > 1000 -> "Положительная"
        list1.contains(3) && list1.contains(14) -> "Пи***тая"
        else -> "Уникальная"
    }
}

//Задача 25. Анализ учебных оценок
//Напиши функцию, которая принимает список чисел и возвращает список чисел.
//Пример данных: val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
//Цель: Отфильтровать удовлетворительные оценки (>=60), отсортировать оставшиеся по возрастанию и взять первые 3.
// Вызывай методы обработки и фильтрации последовательно один из другого, чтобы результат предыдущего метода являлся основой для следующего.
fun fun2(list2: List<Int>): List<Int> {
    return list2
        .filter { it >= 60 }
        . sorted()
        .take(3)
}

//Задача 26. Создание каталога по первой букве
//Напиши функцию, которая принимает список строк и возвращает словарь с ключом - буквой и значением - списком строк.
//Начальные значения: val list = listOf("Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка", "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик", "сувенир", "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка")
//Цель: Привести все слова в списке к нижнему регистру, сгруппировать в каталог по первой букве используя метод groupBy
fun fun3(list3: List<String>): Map<Char, List<String>> {
    return list3
        .map { it.lowercase() }
        .groupBy {it.first() }
}

//Задание 27. Подсчёт средней длины слов в списке
//Напиши функцию, которая принимает список строк и возвращает строку.
//Начальные значения взять из предыдущей задачи.
//Цель: Перевести все слова в количество букв, подсчитать среднее значение.
// Вернуть форматированный текст с двумя знаками после запятой, используя функцию format и подходящий шаблон.
fun fun4(list3: List<String>): String {
    val averageLength = list3
        .map {it.length}
        .average()
    return String.format("%.2f", averageLength)
}
//Задание 28: Категоризация чисел
//Напиши функцию, которая принимает список чисел и возвращает словарь с ключами - строками и значениями - список чисел.
//Цель: Отобрать уникальные числа, отсортировать по убыванию и сгруппировать по четности (“четные” и “нечетные”).
fun fun5(list4: List<Int>): Map<String, List<Int>> {
    return list4
        .distinct()
        .sortedDescending()
        .groupBy { if (it % 2 == 0) "четные" else "нечетные" }
}
//Задание 29: Поиск первого подходящего элемента
//Напиши функцию, которая принимает список чисел и число и возвращает nullable число.
//Цель: Найти первый возраст в списке, который соответствует условию (больше второго аргумента) и вернуть его, либо null если значения не нашлось.
fun fun6(list5: List<Int?>, list6: Int): Int? {
    return list5.find { (it ?: 0) > list6 }
}